[
  {
    "id": "1",
    "title": "TrustedInsight",
    "subTitle": "Social Network",
    "mainPictureUrl": "ti-front-portfolio.png",
    "demoPictureUrl": "flat-apple-ti.png",
    "logoPictureUrl": "",
    "conceptPictureUrl": "ti-portfolio-workflow1.png",
    "extraPictureUrl": "ti-diagram-portfolio.png",
    "url":"https://www.thetrustedinsight.com/news/",
    "about": "The world's largest platform for institutional investors with 100,000 LP investor professionals in 98 countries and territories around the globe.",
    "summaryOne": "Where users can subscribe to a variety of their favorite channels of topics ranging from alternative assets to venture capital. Bookmark interesting articles for later reading, or even crate your own news post. This news platform was created by finance lovers for the institutional investment world.",
    "summaryTwo": "Investment Jobs, career opportunities and jobs postings on Trusted Insight. This career platform for institutional investors was created to aid in user discovery of  investment jobs, talent, alternative investment news, syndicates and top investment managers rankings.",
    "contribution": "Social Network, News & Video, Jobs, Accounts & Subscriptions, Events, Catalogue",
    "deliverables": "Website, Research, User Interface & Experience",
    "languages": "Python, Django, Javascript, HTML5, CSS3, AJAX, JSON",
    "displayOrder": 3
  },
  {
    "id": "2",
    "title": "TrustedInsight:CRM",
    "subTitle": "Customer Relations Management",
    "mainPictureUrl": "ti-front-portfolio.png",
    "demoPictureUrl": "flat-apple-crm.png",
    "logoPictureUrl": "",
    "conceptPictureUrl": "crm-info.png",
    "extraPictureUrl": "crm-diagram.png",
    "url":"",
    "about": "From a startup with zero income to $15,000/month in subscriptions, the staff quickly realized the need for a tool to help manage job posts, user subscriptions and overall user relationships. So we build our own native customer relations management tool. Hurray!",
    "summaryOne": " I researched other CRMs and discovered what worked and what didn’t work for the staff. Staff user experience tests came in handy in creating features that never existed in the realm of current CRMs. Growing strong, the Trusted Insight staff still uses this tool today.",
    "summaryTwo": "",
    "contribution": "Customer Service, Staff Tasks, Sales Productivity",
    "deliverables": "Website, Research, User Interface & Experience",
    "languages": "Python, Angular, Javascript, HTML5, CSS3, AJAX, JSON",
    "displayOrder": 3
  },
  {
    "id": "3",
    "title": "MechGrab",
    "subTitle": "Mechanical keys & accessories",
    "mainPictureUrl": "mech-front-portfolio.png",
    "demoPictureUrl": "mechgrab-flat-main.png",
    "logoPictureUrl": "",
    "conceptPictureUrl": "mech-info.png",
    "extraPictureUrl": "mech-diagram.png",
    "url": "http://www.mechgrab.com",
    "about": "Always trying to get the latest mech keys on Reddit, but always the last one to arrive? Mechmarket aids in your quest for the perfect mech key, keyboard or keyboard accessory. It grabs the responce from reddit and displays to you the latest, most recent posts. All you have to do is click 'Grab list'. Happy Hunting!",
    "summaryOne": "MechMarket is a well-organized reddit community centered around all things mechanical keyboards. The problem I had with it was simply not getting to the best grabs in time and was having difficulty weeding out the selling posts from the buying. Once the problem was identified, I looked to my whiteboard and drew out some flow carts and narrowed down the basic workflow of the MechGrab webapp.",
    "summaryTwo": "",
    "contribution": "Design, Data Parsing, Development, End build",
    "deliverables": "Design, Website, Research, User Interface & Experience",
    "languages": "Node, Express, EJS, Javascript, HTML5, CSS3, JSON",
    "displayOrder": 3
  },
  {
    "id": "4",
    "title": "Ground",
    "subTitle": "Reviews of the best coffee",
    "mainPictureUrl": "ground-front-portfolio.png",
    "demoPictureUrl": "ground-flat-main.png",
    "logoPictureUrl": "",
    "conceptPictureUrl": "ground-info.png",
    "extraPictureUrl": "ground-secondary.png",
    "about": "Coming Soon: Ground provides visitors with reviews of the best artisan coffee grounds for the coffee lover community at large. Discovered a new blend? Write a review about it and tell the world. Or maybe you just wanted to catch up on the latest reviews from your local baristas. Ground is your one stop for all things artisan coffee.",
    "summaryOne": "Sure, I consider myself to be a coffee snob. So I teamed up with some like-minded developer friends to build a space where artisan coffee lovers can join in on the fun. The challenge was creating a visual design that communicates the value of the artisan coffee craft to the laid-back masses. Gathering barista insights with research and analytical data to create a visual design and the overall user persona flow.",
    "summaryTwo": "",
    "contribution": "Network, Forum & Articles",
    "deliverables": "Design, Research, User Interface & Experience, Website IN-PROGRESS",
    "languages": "IN-PROGRESS",
    "displayOrder": 3
  },
  {
    "id": "5",
    "title": "TableSorter",
    "subTitle": "A news sorting test",
    "mainPictureUrl": "flat-apple-sort.png",
    "demoPictureUrl": "flat-apple-sort.png",
    "logoPictureUrl": "",
    "conceptPictureUrl": "",
    "extraPictureUrl": "",
    "about": "The developer is to grab the list news articles and host. This is designed to test the developer in their attention to detail, skill and understanding of standards based development. This test looks to best practices and proper project structuring. Checkout the repository and serve up the results.",
    "summaryOne": "",
    "summaryTwo": "",
    "contribution": "Article Fetching & Sorting",
    "deliverables": "Design, Research, User Interface & Experience, Application",
    "languages": "Node, Express, EJS, Javascript, HTML5, CSS3, AJAX, JSON, GULP",
    "displayOrder": 3
  }
]
